---
kind: other
id: AllMembers.T:Autodesk.Revit.DB.Mechanical.MEPAnalyticalSystem
source: html/0767b405-e241-2ed7-e97f-3f4da914b1e8.htm
---
# MEPAnalyticalSystem Members

Returns true if the properties CreatedPhaseId and DemolishedPhaseId can be modified for this Element.